config/Catalogs/ИА_РазбивочныйТовар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИА_РазбивочныйТовар</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕИТ_НаСайте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕИТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/ИА_РазбивочныйТовар/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый()=Истина ТОгда
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ИА_РазбивочныйТовар.Товар,
		                    |	ИА_РазбивочныйТовар.ЕИТ_НаСайте,
		                    |	ИА_РазбивочныйТовар.ЕИТ_НаСайте.К как к
		                    |ИЗ
		                    |	Справочник.ИА_РазбивочныйТовар КАК ИА_РазбивочныйТовар
		                    |ГДЕ
		                    |	ИА_РазбивочныйТовар.Товар = &Товар");
		Запрос.УстановитьПараметр("Товар",ЭтотОбъект.Товар);
		Рез=Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()<>0 Тогда
			Стр=Рез.Получить(0);
			Сообщить("Уже есть "+Стр.Товар+" единица на сайте "+Стр.ЕИТ_НаСайте+" с коэффициентом "+Стр.К);
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры
